Revit 2027 API
RebarBendingDetailType.BendDiameterDimensionsForHooksEnabled Property
 Identifies if radial or diameter dimensions will be shown for hook fillets. This property has a meaning only if BendDiameterDimensionsEnabled is set to true.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BendDiameterDimensionsForHooksEnabled { get; set; }
Public Property BendDiameterDimensionsForHooksEnabled As Boolean
	Get
	Set
public:
property bool BendDiameterDimensionsForHooksEnabled {
	bool get ();
	void set (bool value);
}
member BendDiameterDimensionsForHooksEnabled : bool with get, set
Property Value
Boolean
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace